#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 723cfcc9fcdd413107f4d8ad65694185.pdb
; shader hash: 723cfcc9fcdd413107f4d8ad65694185
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !14, globals: !33)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CImguiCubePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15}
!15 = !DISubprogram(name: "main", scope: !1, file: !1, line: 29, type: !16, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !20, templateParams: !25)
!20 = !{!21, !22, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!25 = !{!11, !26}
!26 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 10, size: 320, align: 32, elements: !29)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !28, file: !1, line: 12, baseType: !18, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !28, file: !1, line: 13, baseType: !18, size: 128, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !1, line: 14, baseType: !4, size: 64, align: 32, offset: 256)
!33 = !{!34, !36, !37, !39}
!34 = !DIGlobalVariable(name: "F_PI", scope: !0, file: !1, line: 17, type: !35, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!36 = !DIGlobalVariable(name: "F_PI", scope: !0, file: !1, line: 17, type: !35, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariable(name: "Sampler0", linkageName: "\01?Sampler0@@3USamplerState@@A", scope: !0, file: !1, line: 22, type: !38, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?Sampler0@@3USamplerState@@A")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 22, size: 32, align: 32, elements: !2)
!39 = !DIGlobalVariable(name: "Texture0", linkageName: "\01?Texture0@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 23, type: !40, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?Texture0@@3V?$TextureCube@V?$vector@M$03@@@@A")
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 23, size: 128, align: 32, elements: !2, templateParams: !41)
!41 = !{!42}
!42 = !DITemplateTypeParameter(name: "element", type: !19)
!43 = !{i32 2, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!46 = !{!"..\5Cres\5Cshaders\5CImguiCubePS.hlsl", !"//-----------------------------------------------------------------------------\0D\0A// File : ImguiPS.hlsl\0D\0A// Desc : Pixel Shader For Imgui.\0D\0A// Copyright(c) Project Asura. All right reserved.\0D\0A//-----------------------------------------------------------------------------\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// PSInput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float4 Color    : COLOR0;\0D\0A    float2 TexCoord : TEXCOORD0;\0D\0A};\0D\0A\0D\0Astatic const float F_PI = 3.1415926535f;\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A// Textures and Samplers.\0D\0A//-----------------------------------------------------------------------------\0D\0ASamplerState Sampler0 : register(s0);\0D\0ATextureCube  Texture0 : register(t0);\0D\0A\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A//      \E3\83\A1\E3\82\A4\E3\83\B3\E3\82\A8\E3\83\B3\E3\83\88\E3\83\AA\E3\83\BC\E3\83\9D\E3\82\A4\E3\83\B3\E3\83\88\E3\81\A7\E3\81\99.\0D\0A//-----------------------------------------------------------------------------\0D\0Afloat4 main(const PSInput input) : SV_TARGET0\0D\0A{\0D\0A    // [-1, 1]\E3\81\AB\E5\A4\89\E6\9B\B4.\0D\0A    float2 uv = input.TexCoord * float2(2.0f, -2.0f) - float2(1.0f, -1.0f);\0D\0A\0D\0A    float theta = uv.x * F_PI;\0D\0A    float phi   = uv.y * F_PI * 0.5f;\0D\0A\0D\0A    float3 dir;\0D\0A    dir.x = cos(phi) * cos(theta);\0D\0A    dir.y = sin(phi);\0D\0A    dir.z = cos(phi) * sin(theta);\0D\0A\0D\0A    float4 color = Texture0.Sample(Sampler0, dir);\0D\0A    return color * input.Color;\0D\0A}\0D\0A"}
!47 = !{!"..\5Cres\5Cshaders\5CImguiCubePS.hlsl"}
!48 = !{!"-E", !"main", !"-T", !"ps_6_0", !"/Fo", !"C:\5CUsers\5CPocol\5CDocuments\5C01_WS\5CGithub\5Casdx11\5Cproject\5Cx64\5CDebug\5CImguiCubePS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!49 = !{i32 1, i32 0}
!50 = !{i32 1, i32 6}
!51 = !{!"ps", i32 6, i32 0}
!52 = !{!53, null, null, !56}
!53 = !{!54}
!54 = !{i32 0, %"class.TextureCube<vector<float, 4> >"* undef, !"Texture0", i32 0, i32 0, i32 1, i32 5, i32 0, !55}
!55 = !{i32 0, i32 9}
!56 = !{!57}
!57 = !{i32 0, %struct.SamplerState* undef, !"Sampler0", i32 0, i32 0, i32 1, i32 0, null}
!58 = !{i32 0, %"class.TextureCube<vector<float, 4> >" undef, !59, %struct.PSInput undef, !61}
!59 = !{i32 16, !60}
!60 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!61 = !{i32 40, !62, !63, !64}
!62 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!63 = !{i32 6, !"Color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!64 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD0", i32 7, i32 9}
!65 = !{i32 1, void ()* @main, !66}
!66 = !{!67}
!67 = !{i32 0, !2, !2}
!68 = !{[12 x i32] [i32 10, i32 4, i32 0, i32 0, i32 0, i32 0, i32 1, i32 2, i32 4, i32 8, i32 15, i32 15]}
!69 = !{void ()* @main, !"main", !70, !52, !80}
!70 = !{!71, !78, null}
!71 = !{!72, !74, !76}
!72 = !{i32 0, !"SV_Position", i8 9, i8 3, !73, i8 4, i32 1, i8 4, i32 0, i8 0, null}
!73 = !{i32 0}
!74 = !{i32 1, !"COLOR", i8 9, i8 0, !73, i8 2, i32 1, i8 4, i32 1, i8 0, !75}
!75 = !{i32 3, i32 15}
!76 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !73, i8 2, i32 1, i8 2, i32 2, i8 0, !77}
!77 = !{i32 3, i32 3}
!78 = !{!79}
!79 = !{i32 0, !"SV_Target", i8 9, i8 16, !73, i8 0, i32 1, i8 4, i32 0, i8 0, !75}
!80 = !{i32 0, i64 1}
!81 = !DILocation(line: 42, column: 20, scope: !15)
!82 = !DILocation(line: 29, column: 27, scope: !15)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !15, file: !1, line: 29, type: !27)
!84 = !DIExpression(DW_OP_bit_piece, 256, 32)
!85 = !DIExpression(DW_OP_bit_piece, 288, 32)
!86 = !DIExpression(DW_OP_bit_piece, 128, 32)
!87 = !DIExpression(DW_OP_bit_piece, 160, 32)
!88 = !DIExpression(DW_OP_bit_piece, 192, 32)
!89 = !DIExpression(DW_OP_bit_piece, 224, 32)
!90 = !DILocation(line: 32, column: 32, scope: !15)
!91 = !DILocation(line: 32, column: 54, scope: !15)
!92 = !DILocation(line: 32, column: 12, scope: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !15, file: !1, line: 32, type: !4)
!94 = !DIExpression(DW_OP_bit_piece, 0, 32)
!95 = !DIExpression(DW_OP_bit_piece, 32, 32)
!96 = !DILocation(line: 34, column: 24, scope: !15)
!97 = !DILocation(line: 34, column: 11, scope: !15)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "theta", scope: !15, file: !1, line: 34, type: !8)
!99 = !DIExpression()
!100 = !DILocation(line: 35, column: 24, scope: !15)
!101 = !DILocation(line: 35, column: 31, scope: !15)
!102 = !DILocation(line: 35, column: 11, scope: !15)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !15, file: !1, line: 35, type: !8)
!104 = !DILocation(line: 38, column: 13, scope: !15)
!105 = !DILocation(line: 38, column: 24, scope: !15)
!106 = !DILocation(line: 38, column: 22, scope: !15)
!107 = !DILocation(line: 38, column: 11, scope: !15)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !15, file: !1, line: 37, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !111, templateParams: !115)
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !110, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !110, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !110, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!115 = !{!11, !116}
!116 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!117 = !DILocation(line: 37, column: 12, scope: !15)
!118 = !DILocation(line: 39, column: 13, scope: !15)
!119 = !DILocation(line: 39, column: 11, scope: !15)
!120 = !DILocation(line: 40, column: 13, scope: !15)
!121 = !DILocation(line: 40, column: 24, scope: !15)
!122 = !DILocation(line: 40, column: 22, scope: !15)
!123 = !DILocation(line: 40, column: 11, scope: !15)
!124 = !DIExpression(DW_OP_bit_piece, 64, 32)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !15, file: !1, line: 42, type: !18)
!126 = !DILocation(line: 42, column: 12, scope: !15)
!127 = !DILocation(line: 43, column: 18, scope: !15)
!128 = !DILocation(line: 43, column: 5, scope: !15)

#endif

const unsigned char ImguiCubePS[] = {
  0x44, 0x58, 0x42, 0x43, 0x61, 0x1d, 0x6c, 0x11, 0x08, 0xaa, 0x90, 0x02,
  0x7b, 0x57, 0x72, 0xec, 0x8a, 0xb4, 0xb1, 0xc6, 0x01, 0x00, 0x00, 0x00,
  0xd5, 0x2a, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xdf, 0x00, 0x00, 0x00, 0x19, 0x01, 0x00, 0x00,
  0x1d, 0x02, 0x00, 0x00, 0x15, 0x1b, 0x00, 0x00, 0xd1, 0x22, 0x00, 0x00,
  0x05, 0x23, 0x00, 0x00, 0x21, 0x23, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x49, 0x53, 0x47, 0x31, 0x83, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x68, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x0f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x74, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x0f, 0x0f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x7a, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x03, 0x03, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x53, 0x56, 0x5f, 0x50, 0x6f, 0x73, 0x69, 0x74,
  0x69, 0x6f, 0x6e, 0x00, 0x43, 0x4f, 0x4c, 0x4f, 0x52, 0x00, 0x54, 0x45,
  0x58, 0x43, 0x4f, 0x4f, 0x52, 0x44, 0x00, 0x4f, 0x53, 0x47, 0x31, 0x32,
  0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x28, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x40,
  0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0f,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x53, 0x56, 0x5f, 0x54, 0x61,
  0x72, 0x67, 0x65, 0x74, 0x00, 0x50, 0x53, 0x56, 0x30, 0xfc, 0x00, 0x00,
  0x00, 0x30, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0xff, 0xff, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00, 0x03, 0x01, 0x00,
  0x03, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00,
  0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x0e, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x10, 0x00, 0x00, 0x00, 0x00, 0x43, 0x4f, 0x4c, 0x4f, 0x52, 0x00,
  0x54, 0x45, 0x58, 0x43, 0x4f, 0x4f, 0x52, 0x44, 0x00, 0x01, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x44, 0x03, 0x03, 0x04, 0x00,
  0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x01, 0x44,
  0x00, 0x03, 0x02, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x01, 0x02, 0x42, 0x00, 0x03, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x44, 0x10, 0x03, 0x00, 0x00,
