#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: 4764f0d48167c04c074484cc27eeaa59.pdb
; shader hash: 4764f0d48167c04c074484cc27eeaa59
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !38)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CImguiVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 32, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 32, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 38, type: !18, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 20, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 22, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 23, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 24, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 32, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 32, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 10, size: 256, align: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !33, file: !1, line: 12, baseType: !25, size: 64, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !33, file: !1, line: 13, baseType: !4, size: 128, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !33, file: !1, line: 14, baseType: !25, size: 64, align: 32, offset: 192)
!38 = !{!39}
!39 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@CbTransform@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 32, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 32, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 32, size: 512, align: 32, elements: !43, templateParams: !60)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !42, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!60 = !{!13, !61, !62}
!61 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!62 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!66 = !{!"..\5Cres\5Cshaders\5CImguiVS.hlsl", !"//-----------------------------------------------------------------------------\0D\0A// File : ImguiVS.hlsl\0D\0A// Desc : Vertex Shader For Imgui.\0D\0A// Copyright(c) Project Asura. All right reserved.\0D\0A//-----------------------------------------------------------------------------\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSInput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSInput\0D\0A{\0D\0A    float2 Position : POSITION;\0D\0A    float4 Color    : COLOR0;\0D\0A    float2 TexCoord : TEXCOORD0;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// PSInput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float4 Color    : COLOR0;\0D\0A    float2 TexCoord : TEXCOORD0;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// CbTransform constant buffer.\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Acbuffer CbTransform : register(b0)\0D\0A{\0D\0A    float4x4 ProjectionMatrix;\0D\0A};\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A//      \E3\83\A1\E3\82\A4\E3\83\B3\E3\82\A8\E3\83\B3\E3\83\88\E3\83\AA\E3\83\BC\E3\83\9D\E3\82\A4\E3\83\B3\E3\83\88\E3\81\A7\E3\81\99.\0D\0A//-----------------------------------------------------------------------------\0D\0APSInput main(const VSInput input)\0D\0A{\0D\0A    PSInput output;\0D\0A    output.Position = mul(ProjectionMatrix, float4(input.Position, 0.0f, 1.0f));\0D\0A    output.Color    = input.Color;\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    return output;\0D\0A}\0D\0A"}
!67 = !{!"..\5Cres\5Cshaders\5CImguiVS.hlsl"}
!68 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"C:\5CUsers\5CPocol\5CDocuments\5C01_WS\5CGithub\5Casdx11\5Cproject\5Cx64\5CDebug\5CImguiVS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!69 = !{i32 1, i32 0}
!70 = !{i32 1, i32 6}
!71 = !{!"vs", i32 6, i32 0}
!72 = !{null, null, !73, null}
!73 = !{!74}
!74 = !{i32 0, %dx.alignment.legacy.CbTransform* undef, !"CbTransform", i32 0, i32 0, i32 1, i32 64, null}
!75 = !{i32 0, %struct.PSInput undef, !76, %struct.VSInput undef, !80, %CbTransform undef, !82, %dx.alignment.legacy.CbTransform undef, !82}
!76 = !{i32 40, !77, !78, !79}
!77 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!78 = !{i32 6, !"Color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!79 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD0", i32 7, i32 9}
!80 = !{i32 40, !81, !78, !79}
!81 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!82 = !{i32 64, !83}
!83 = !{i32 6, !"ProjectionMatrix", i32 2, !84, i32 3, i32 0, i32 7, i32 9}
!84 = !{i32 4, i32 4, i32 2}
!85 = !{i32 1, void ()* @main, !86}
!86 = !{!87}
!87 = !{i32 0, !2, !2}
!88 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 0, i32 0, i32 16, i32 32, i32 64, i32 128, i32 256, i32 512]}
!89 = !{void ()* @main, !"main", !90, !72, !102}
!90 = !{!91, !98, null}
!91 = !{!92, !95, !97}
!92 = !{i32 0, !"POSITION", i8 9, i8 0, !93, i8 0, i32 1, i8 2, i32 0, i8 0, !94}
!93 = !{i32 0}
!94 = !{i32 3, i32 3}
!95 = !{i32 1, !"COLOR", i8 9, i8 0, !93, i8 0, i32 1, i8 4, i32 1, i8 0, !96}
!96 = !{i32 3, i32 15}
