#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xyz         1     NONE   float   xyz 
;
; shader debug name: 29e5bf82c72b3b02aa3c10a516ac3c1d.pdb
; shader hash: 29e5bf82c72b3b02aa3c10a516ac3c1d
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Buffer Definitions:
;
; cbuffer CbSkyBox
; {
;
;   struct dx.alignment.legacy.CbSkyBox
;   {
;
;       column_major float4x4 World;                  ; Offset:    0
;       column_major float4x4 View;                   ; Offset:   64
;       column_major float4x4 Proj;                   ; Offset:  128

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !36)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CSkyBoxVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 33, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 33, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 39, type: !18, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 18, size: 224, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 20, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 21, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 32, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 32, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 10, size: 96, align: 32, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !33, file: !1, line: 12, baseType: !24, size: 96, align: 32)
!36 = !{!37, !61, !62, !63, !65}
!37 = !DIGlobalVariable(name: "World", linkageName: "\01?World@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 29, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 29, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 29, size: 512, align: 32, elements: !41, templateParams: !58)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !40, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!58 = !{!13, !59, !60}
!59 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!60 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!61 = !DIGlobalVariable(name: "View", linkageName: "\01?View@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 30, type: !38, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "Proj", linkageName: "\01?Proj@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 31, type: !38, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariable(name: "CameraPos", linkageName: "\01?CameraPos@CbSkyBox@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 32, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!65 = !DIGlobalVariable(name: "BoxSize", linkageName: "\01?BoxSize@CbSkyBox@@3MB", scope: !0, file: !1, line: 33, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!67 = !{i32 2, !"Dwarf Version", i32 4}
!68 = !{i32 2, !"Debug Info Version", i32 3}
!69 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!70 = !{!"..\5Cres\5Cshaders\5CSkyBoxVS.hlsl", !"//-----------------------------------------------------------------------------\0D\0A// File : SkyBoxVS.hlsl\0D\0A// Desc : Vertex Shader For SkyBox.\0D\0A// Copyright(c) Project Asura. All right reserved.\0D\0A//-----------------------------------------------------------------------------\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSInput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSOutput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float3 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// CbSkyBox structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Acbuffer CbSkyBox : register(b0)\0D\0A{\0D\0A    float4x4 World      : packoffset(c0);\0D\0A    float4x4 View       : packoffset(c4);\0D\0A    float4x4 Proj       : packoffset(c8);\0D\0A    float3   CameraPos  : packoffset(c12);\0D\0A    float    BoxSize    : packoffset(c12.w);\0D\0A}\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A//      \E3\83\A1\E3\82\A4\E3\83\B3\E3\82\A8\E3\83\B3\E3\83\88\E3\83\AA\E3\83\BC\E3\83\9D\E3\82\A4\E3\83\B3\E3\83\88\E3\81\A7\E3\81\99.\0D\0A//-----------------------------------------------------------------------------\0D\0AVSOutput main(const VSInput input)\0D\0A{\0D\0A    VSOutput output = (VSOutput)0;\0D\0A\0D\0A    float4 localPos = float4( input.Position * BoxSize, 1.0f );\0D\0A    float4 worldPos = mul( World, localPos );\0D\0A    float4 viewPos  = mul( View,  worldPos );\0D\0A    float4 projPos  = mul( Proj,  viewPos );\0D\0A\0D\0A    output.Position = projPos;\0D\0A    output.TexCoord = worldPos.xyz - CameraPos;\0D\0A\0D\0A    // \E5\B7\A6\E5\8F\B3\E5\8F\8D\E8\BB\A2.\0D\0A    output.TexCoord.x *= -1.0f;\0D\0A\0D\0A    return output;\0D\0A}"}
!71 = !{!"..\5Cres\5Cshaders\5CSkyBoxVS.hlsl"}
!72 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"C:\5CUsers\5CPocol\5CDocuments\5C01_WS\5CGithub\5Cd3d11_samples\5C001_d3d11on12\5Cproject\5Cx64\5CDebug\5CSkyBoxVS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!73 = !{i32 1, i32 0}
!74 = !{i32 1, i32 6}
!75 = !{!"vs", i32 6, i32 0}
!76 = !{null, null, !77, null}
!77 = !{!78}
