#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TANGENT                  0   xyz         3     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TANGENT                  0   xyz         2     NONE   float   xyz 
; BINORMAL                 0   xyz         3     NONE   float   xyz 
;
; shader debug name: a4f0a896fdb0f68b9e9e47504546e165.pdb
; shader hash: a4f0a896fdb0f68b9e9e47504546e165
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; NORMAL                   0                              
; TANGENT                  0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !63)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CSkySphereVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 37, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 37, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 54, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 54, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 43, type: !33, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !56}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 21, size: 384, align: 32, elements: !36)
!36 = !{!37, !38, !46, !55}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 23, baseType: !4, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 24, baseType: !39, size: 64, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 37, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 37, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Tangent", scope: !35, file: !1, line: 25, baseType: !47, size: 96, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !49, templateParams: !53)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !48, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Binormal", scope: !35, file: !1, line: 26, baseType: !47, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 10, size: 352, align: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !57, file: !1, line: 12, baseType: !47, size: 96, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !57, file: !1, line: 13, baseType: !39, size: 64, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !57, file: !1, line: 14, baseType: !47, size: 96, align: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Tangent", scope: !57, file: !1, line: 15, baseType: !47, size: 96, align: 32, offset: 256)
!63 = !{!64, !88, !89, !90}
!64 = !DIGlobalVariable(name: "World", linkageName: "\01?World@CbSkySphere@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 34, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !68, templateParams: !85)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !67, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!85 = !{!13, !86, !87}
!86 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!87 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!88 = !DIGlobalVariable(name: "View", linkageName: "\01?View@CbSkySphere@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 35, type: !65, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "Proj", linkageName: "\01?Proj@CbSkySphere@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 36, type: !65, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "SphereSize", linkageName: "\01?SphereSize@CbSkySphere@@3MB", scope: !0, file: !1, line: 37, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!95 = !{!"..\5Cres\5Cshaders\5CSkySphereVS.hlsl", !"//-----------------------------------------------------------------------------\0D\0A// File : SkySphereVS.hlsl\0D\0A// Desc : Vertex Shader For SkySphere.\0D\0A// Copyright(c) Project Asura. All right reserved.\0D\0A//-----------------------------------------------------------------------------\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSInput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float3 Normal   : NORMAL;\0D\0A    float3 Tangent  : TANGENT;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSOutput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4      Position        : SV_POSITION;\0D\0A    float2      TexCoord        : TEXCOORD;\0D\0A    float3      Tangent         : TANGENT;\0D\0A    float3      Binormal        : BINORMAL;\0D\0A};\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// CbSkySphere structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Acbuffer CbSkySphere : register(b0)\0D\0A{\0D\0A    float4x4 World      : packoffset(c0);\0D\0A    float4x4 View       : packoffset(c4);\0D\0A    float4x4 Proj       : packoffset(c8);\0D\0A    float    SphereSize : packoffset(c12);\0D\0A}\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A//      \E3\83\A1\E3\82\A4\E3\83\B3\E3\82\A8\E3\83\B3\E3\83\88\E3\83\AA\E3\83\BC\E3\83\9D\E3\82\A4\E3\83\B3\E3\83\88\E3\81\A7\E3\81\99.\0D\0A//-----------------------------------------------------------------------------\0D\0AVSOutput main(const VSInput input)\0D\0A{\0D\0A    VSOutput output = (VSOutput)0;\0D\0A\0D\0A    float4 localPos = float4(input.Position * SphereSize, 1.0f);\0D\0A    float4 worldPos = mul(World, localPos);\0D\0A    float4 viewPos  = mul(View, worldPos);\0D\0A    float4 projPos  = mul(Proj, viewPos);\0D\0A\0D\0A    float3 N = normalize(input.Normal);\0D\0A    float3 T = normalize(input.Tangent);\0D\0A    N = mul((float3x3)World, N);\0D\0A    T = mul((float3x3)World, T);\0D\0A    float3 B = cross(N, T);\0D\0A\0D\0A    output.Position     = projPos;\0D\0A    output.TexCoord     = input.TexCoord;\0D\0A    output.Tangent      = T;\0D\0A    output.Binormal     = B;\0D\0A\0D\0A    return output;\0D\0A}"}
!96 = !{!"..\5Cres\5Cshaders\5CSkySphereVS.hlsl"}
!97 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"C:\5CUsers\5CPocol\5CDocuments\5C01_WS\5CGithub\5Cd3d11_samples\5C001_d3d11on12\5Cproject\5Cx64\5CDebug\5CSkySphereVS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!98 = !{i32 1, i32 0}
!99 = !{i32 1, i32 6}
