#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TANGENT                  0   xyz         2     NONE   float       
; BINORMAL                 0   xyz         3     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 2b0d9aec931b2f4d081b0fec503a2917.pdb
; shader hash: 2b0d9aec931b2f4d081b0fec503a2917
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TANGENT                  0                 linear       
; BINORMAL                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !42)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CSkySpherePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 27, type: !18, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 10, size: 384, align: 32, elements: !22)
!22 = !{!23, !24, !32, !41}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !21, file: !1, line: 12, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !21, file: !1, line: 13, baseType: !25, size: 64, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Tangent", scope: !21, file: !1, line: 14, baseType: !33, size: 96, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Binormal", scope: !21, file: !1, line: 15, baseType: !33, size: 96, align: 32, offset: 288)
!42 = !{!43, !47}
!43 = !DIGlobalVariable(name: "SphereMap", linkageName: "\01?SphereMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 21, type: !44, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?SphereMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 21, size: 160, align: 32, elements: !2, templateParams: !45)
!45 = !{!46}
!46 = !DITemplateTypeParameter(name: "element", type: !5)
!47 = !DIGlobalVariable(name: "SphereSmp", linkageName: "\01?SphereSmp@@3USamplerState@@A", scope: !0, file: !1, line: 22, type: !48, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SphereSmp@@3USamplerState@@A")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 22, size: 32, align: 32, elements: !2)
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!52 = !{!"..\5Cres\5Cshaders\5CSkySpherePS.hlsl", !"//-----------------------------------------------------------------------------\0D\0A// File : SkySpherePS.hlsl\0D\0A// Desc : Pixel Shader For SkySphere.\0D\0A// Copyright(c) Project Asura. All right reserved.\0D\0A//-----------------------------------------------------------------------------\0D\0A\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0A// VSOutput structure\0D\0A///////////////////////////////////////////////////////////////////////////////\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4   Position       : SV_POSITION;\0D\0A    float2   TexCoord       : TEXCOORD;\0D\0A    float3   Tangent         : TANGENT;\0D\0A    float3   Binormal        : BINORMAL;\0D\0A};\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A// Textures and Samplers.\0D\0A//-----------------------------------------------------------------------------\0D\0ATexture2D    SphereMap : register(t0);\0D\0ASamplerState SphereSmp : register(s0);\0D\0A\0D\0A//-----------------------------------------------------------------------------\0D\0A//      \E3\83\A1\E3\82\A4\E3\83\B3\E3\82\A8\E3\83\B3\E3\83\88\E3\83\AA\E3\83\BC\E3\83\9D\E3\82\A4\E3\83\B3\E3\83\88\E3\81\A7\E3\81\99.\0D\0A//-----------------------------------------------------------------------------\0D\0Afloat4 main(const VSOutput input) : SV_TARGET\0D\0A{\0D\0A    float3 color = SphereMap.SampleLevel(SphereSmp, input.TexCoord, 0).rgb;\0D\0A    return float4(color, 0.0f);\0D\0A}"}
!53 = !{!"..\5Cres\5Cshaders\5CSkySpherePS.hlsl"}
!54 = !{!"-E", !"main", !"-T", !"ps_6_0", !"/Fo", !"C:\5CUsers\5CPocol\5CDocuments\5C01_WS\5CGithub\5Cd3d11_samples\5C001_d3d11on12\5Cproject\5Cx64\5CDebug\5CSkySpherePS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!55 = !{i32 1, i32 0}
!56 = !{i32 1, i32 6}
!57 = !{!"ps", i32 6, i32 0}
!58 = !{!59, null, null, !62}
!59 = !{!60}
!60 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"SphereMap", i32 0, i32 0, i32 1, i32 2, i32 0, !61}
!61 = !{i32 0, i32 9}
!62 = !{!63}
!63 = !{i32 0, %struct.SamplerState* undef, !"SphereSmp", i32 0, i32 0, i32 1, i32 0, null}
!64 = !{i32 0, %"class.Texture2D<vector<float, 4> >" undef, !65, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !68, %struct.VSOutput undef, !70}
!65 = !{i32 20, !66, !67}
!66 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!67 = !{i32 6, !"mips", i32 3, i32 16}
!68 = !{i32 4, !69}
!69 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!70 = !{i32 60, !71, !72, !73, !74}
!71 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!72 = !{i32 6, !"TexCoord", i32 3, i32 16, i32 4, !"TEXCOORD", i32 7, i32 9}
!73 = !{i32 6, !"Tangent", i32 3, i32 32, i32 4, !"TANGENT", i32 7, i32 9}
