#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TANGENT                  0   xyz         2     NONE   float   xyz 
; BINORMAL                 0   xyz         3     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 78ea0b8b119f3b9a6c4088977c62b4fa.pdb
; shader hash: 78ea0b8b119f3b9a6c4088977c62b4fa
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TANGENT                  0                 linear       
; BINORMAL                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !42)
!1 = !DIFile(filename: "..\5Cres\5Cshaders\5CSkySphereFlowPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !{!24}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 37, type: !25, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{!14, !27}
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 10, size: 384, align: 32, elements: !29)
!29 = !{!30, !31, !32, !41}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !28, file: !1, line: 12, baseType: !14, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !1, line: 13, baseType: !4, size: 64, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Tangent", scope: !28, file: !1, line: 14, baseType: !33, size: 96, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 29, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 29, size: 96, align: 32, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!11, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Binormal", scope: !28, file: !1, line: 15, baseType: !33, size: 96, align: 32, offset: 288)
!42 = !{!43, !45, !47, !48, !52}
!43 = !DIGlobalVariable(name: "WindDirection", linkageName: "\01?WindDirection@CbSkySphereFlow@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 29, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!45 = !DIGlobalVariable(name: "Offset0", linkageName: "\01?Offset0@CbSkySphereFlow@@3MB", scope: !0, file: !1, line: 30, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!47 = !DIGlobalVariable(name: "Offset1", linkageName: "\01?Offset1@CbSkySphereFlow@@3MB", scope: !0, file: !1, line: 31, type: !46, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariable(name: "SphereMap", linkageName: "\01?SphereMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 21, type: !49, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?SphereMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 21, size: 160, align: 32, elements: !2, templateParams: !50)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "element", type: !15)
!52 = !DIGlobalVariable(name: "SphereSmp", linkageName: "\01?SphereSmp@@3USamplerState@@A", scope: !0, file: !1, line: 22, type: !53, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SphereSmp@@3USamplerState@@A")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 22, size: 32, align: 32, elements: !2)
!54 = !{i32 2, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
